Revit 2027 API
Subelement.HasParameter Method
 Checks if this subelement have given parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasParameter(
	ElementId parameterId
)
Public Function HasParameter (
	parameterId As ElementId
) As Boolean
public:
bool HasParameter(
	ElementId^ parameterId
)
member HasParameter :
        parameterId : ElementId -> bool
Parameters
parameterId ElementId
 Parameter id.
Return Value
Boolean
 True if %parameterId% identifies valid parameter of this subelement, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace